<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;

use Spatie\Permission\Models\Permission;


class PermissionTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $permissions = [
            'الاصناف',
            'اضافة صنف',
            'حذف صنف',
            'تعديل صنف',
            'عرض صنف',


           'الفئات',
            'اضافة فئه',
            'حذف فئه',
            'تعديل فئه',
            'عرض فئه',


            'العروض',
            'اضافة عرض',
            'حذف عرض',
            'تعديل عرض',
            'اظهار العرض',


            'المنتجات',
            'اضافة منتج',
            'حذف منتج',
            'تعديل منتج',
            'عرض منتج',


           'تنظيم الفعاليات',
           'حذف الفعاليات',
           'تعديل الفعاليات',
           'عرض الفعاليات',


            'الامتياز التجاري',
            'عرض الامتياز',
            'تعديل الامتياز',
            'حذف الامتياز',


            'الكورسات',
            'اضافة كورس',
            'عرض الكورس',
            'تعديل الكورسات',
            'حذف الكورسات',


            'الشهادات',
            'حذف بيانات الشهاده',
            'عرض بيانات الشهاده',


            'المتدربين',
            'عرض المتدربين',
            'تعديل المتدربين',
            'حذف المتدربين',

           




            'عن الكافيه',
            'تعديل صفحة عن الكافيه',

            'تواصل معنا',
            'حذف الرسايل في صفحة تواصل معنا',
            'عرض الرسايل  في صفحة تواصل معنا',


            'الاراء',
            'حذف الرسايل  في صفحة  الاراء',

            'المستخدمين',
            'اضافة مستخدم',
            'حذف مستخدم',
            'تعديل مستخدم',

            'صلاحيات المستخدمين',
            'عرض صلاحيه',
            'اضافة صلاحيه',
            'حذف صلاحيه',
            'تعديل صلاحيه',

            'لوحة التحكم'

        ];

        foreach ($permissions as $permission) {
            Permission::create(['name' => $permission]);
        }

    }
}
